"""
切片
list
str
bytes

对象实现__getitem__()、__setitem__()方法
"""

l = [1,2,3,4,5,6,7,8]
l[:]
l[:-1]
l[:5]

l[2:]
l[-3:]

l[2:5]
l[2:-1]
l[-3:-1]

# 切片时index越界不会报错
# 访问单个元素不行 IndexError

# 总结：切片操作在右边会复制内容，在左边会覆盖内容！！！

# 对原列表切割后，会生成新的列表，修改切片中的元素，不会改变原列表中的值
a = [1,2,3,4,5,6]
b = a[1:5]
b[2]="hello"
print(b)
# [2, 3, 'hello', 5]
print(a)
# [1, 2, 3, 4, 5, 6]

# 赋值时对左侧列表使用切割，指定范围内的对象会换成新值
a[1:3] = "hello"
print(a)
# [1, 'h', 'e', 'l', 'l', 'o', 4, 5, 6]

c = a[:]
print(c) # 浅拷贝
# [1, 'h', 'e', 'l', 'l', 'o', 4, 5, 6]

a[:] = [2,3,4]
print(a) 
# [2, 3, 4]